{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "6d0847ec",
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, RDFXML, JSON\n",
    "import requests\n",
    "import time\n",
    "\n",
    "# Basic configuration\n",
    "endpoint = \"https://wb.pcp-on-web.de/store-oker/research/\"\n",
    "\n",
    "# This function counts the genrated tripples of the research ontolgy (data:)\n",
    "def count_triples(endpoint,graph) :\n",
    "    #count number of exiting triples\n",
    "    sparql = SPARQLWrapper(endpoint+'sparql')\n",
    "    sparql.setQuery('SELECT (COUNT(*) as ?Triples) FROM '+graph+' WHERE { ?s ?p ?o}')\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    json_results = sparql.query().convert()\n",
    "    return json_results['results']['bindings'][0]['Triples']['value']\n",
    "    \n",
    "\n",
    "# This function executes a sparql construct query and imports the data to the research ontolgy (data:)\n",
    "def query_sparql(query, endpoint) :\n",
    "    start_time = time.time()\n",
    "    \n",
    "    #perform construct Query\n",
    "    sparql = SPARQLWrapper(endpoint+'sparql')\n",
    "  \n",
    "    #query += \" LIMIT 10\"\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(RDFXML)\n",
    "    sparql.setOnlyConneg(True)\n",
    "    resultsets = sparql.query().convert()\n",
    "    result = resultsets.serialize(format='ttl')\n",
    "    \n",
    "    # Add PREFIXs to data to insert\n",
    "    data=\"\"\n",
    "    data_graph=\"leer\"\n",
    "    text_lines = query.split(\"\\n\")\n",
    "    info = text_lines[1]+\"\\n\"+text_lines[2]\n",
    "    for line in text_lines:\n",
    "        if line.find(\"PREFIX \")==0:\n",
    "           data += line + \"\\n\"\n",
    "           p = 0\n",
    "           p = line.find(\"PREFIX data:\") \n",
    "           if p == 0 :\n",
    "                data_graph = line[line.find(\"<\"):]\n",
    "            \n",
    "    # Add SPARQL INSERT to data to insert\n",
    "    data += \"INSERT DATA {\\nGRAPH data:\\n{\\n\"\n",
    "    text_lines = result.split(\"\\n\")\n",
    "    for line in text_lines:\n",
    "        if line.find(\"@prefix \")==-1:\n",
    "           data += line + \"\\n\"\n",
    "    # Close\n",
    "    data += \"}}\"\n",
    "   \n",
    "    start_count = count_triples(endpoint,data_graph)\n",
    "    \n",
    "    sparql = SPARQLWrapper(endpoint)\n",
    "    sparql.setQuery(data)\n",
    "    sparql.method = 'POST'\n",
    "    sparql.query()\n",
    "\n",
    "    end_count = count_triples(endpoint,data_graph)\n",
    "\n",
    "    output =  \"\\n\"+info+\"\\n\"+start_count + \"-\" + end_count + \"\\n--- \" + str(time.time() - start_time) + \" seconds ---\"\n",
    "    return output\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "8ca36f8b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Basic Import of Lecturers including relevant attributes and pictures\n",
      "#-----\n",
      "33348-36002\n",
      "--- 1.1767358779907227 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Basic Import of Lecturers including relevant attributes and pictures\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX bamberg: <http://professorenkatalog.uni-bamberg.de/>\n",
    "\n",
    "CONSTRUCT   {\n",
    "\n",
    "?lecturer rdf:type pcp:Lecturer.\n",
    "?lecturer pcp:derivedFrom ?professor.\n",
    "\n",
    "?lecturer pcp:gnd ?gnd.\n",
    "?lecturer rdfs:label ?label .\n",
    "?lecturer pcp:note ?note .\n",
    "?lecturer pcp:furtherInformation ?furtherInformation .\n",
    "?lecturer pcp:additionToSurname ?additionToSurname .\n",
    "?lecturer pcp:alternativeWritingOfSurname ?alternativeWritingOfSurname .\n",
    "?lecturer pcp:forename ?forename .\n",
    "?lecturer pcp:surname ?surname .\n",
    "?lecturer rdfs:seeAlso ?webLink .\n",
    "?lecturer rdfs:seeAlso ?seeAlso .\n",
    "\n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "WHERE {\n",
    "  \n",
    "  GRAPH bamberg: {  \n",
    "\n",
    "      # Import all Professors relevant for Early Modern History\n",
    "      ?professor a cpm:Professor.\n",
    "      ?professor cpm:hasPeriod ?prof_birth.\n",
    "      ?prof_birth a cpm:Birth.\n",
    "      ?prof_birth cpm:date ?prof_birth_date .\n",
    "      BIND (xsd:integer(substr(str(?prof_birth_date), 1, 4)) as ?prof_birth_year)       \n",
    "      FILTER (!BOUND(?prof_birth_year) || ((?prof_birth_year>1450) && (?prof_birth_year<1800)))\n",
    "      BIND (IRI(REPLACE(REPLACE(str(?professor),'#','_'),'http://professorenkatalog.uni-bamberg.de/rdf/',CONCAT(str(data:),'bamberg/'))) AS ?lecturer). \n",
    "\n",
    "      #retreive label from professor\n",
    "      OPTIONAL { ?professor cpm:surname ?surname.}\n",
    "      OPTIONAL { ?professor cpm:forename ?prof_forename.}\n",
    "      OPTIONAL { ?professor cpm:firstName ?prof_firstName.}\n",
    "      BIND (IF (BOUND(?prof_forename), ?prof_forename, ?prof_firstName)  as ?forename)\n",
    "      BIND (CONCAT(?forename, ' ',  ?surname) as ?label)\n",
    "\n",
    "      OPTIONAL {?professor cpm:note ?note.}\n",
    "      OPTIONAL {?professor cpm:furtherInformation ?furtherInformation.}\n",
    "      OPTIONAL {?professor cpm:webLink ?webLink.}\n",
    "      OPTIONAL {?professor rdfs:seeAlso ?seeAlso.}\n",
    "      OPTIONAL {?professor cpm:references ?references.}\n",
    "      OPTIONAL {?professor cpm:literature ?literature.}\n",
    "      OPTIONAL {?professor cpm:alternativeWritingOfSurname ?alternativeWritingOfSurname.}\n",
    "      OPTIONAL {?professor cpm:gnd ?gnd.}\n",
    "  }\n",
    "}\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "2d17e628",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Basic Import of Lecturers Geburt und Tod\n",
      "#-----\n",
      "36002-39889\n",
      "--- 2.0332157611846924 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Basic Import of Lecturers Geburt und Tod\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX bamberg: <http://professorenkatalog.uni-bamberg.de/>\n",
    "\n",
    "CONSTRUCT {\n",
    "\n",
    "# Lecturer\n",
    "?pcp_period rdf:type ?pcp_period_type.\n",
    "?pcp_period pcp:derivedFrom ?period.\n",
    "?lecturer pcp:hasStageOfLife ?pcp_period.\n",
    "\n",
    "# Stage of Life dates\n",
    "?pcp_period pcp:date ?date.\n",
    "?pcp_period pcp:from ?from.\n",
    "?pcp_period pcp:to ?to.\n",
    "?pcp_period rdfs:label ?period_label.\n",
    "?pcp_period rdfs:comment ?note.\n",
    "\n",
    "# Stage of Life location\n",
    "?pcp_period pcp:stageOfLifeLocation ?pcp_place.\n",
    "?pcp_place rdf:type pcp:Location.\n",
    "?pcp_place rdfs:label ?place_label.\n",
    "?pcp_place pcp:derivedFrom ?place.\n",
    "\n",
    "}\n",
    "\n",
    "WHERE {\n",
    "  \n",
    "  GRAPH data: {  \n",
    "    ?lecturer rdf:type pcp:Lecturer.\n",
    "    FILTER contains(str(?lecturer),\"/bamberg/\")\n",
    "    ?lecturer pcp:derivedFrom ?professor.\n",
    "  }\n",
    "  GRAPH bamberg: {  \n",
    "\n",
    "      # Import all Professors relevant for Early Modern History\n",
    "      ?professor cpm:hasPeriod ?period.\n",
    "      ?period rdf:type ?period_type.\n",
    "      FILTER(contains(str(?period_type),\"Birth\")||contains(str(?period_type),\"Death\"))\n",
    "\n",
    "      BIND (IRI(REPLACE(REPLACE(str(?period),'#','_'),'http://professorenkatalog.uni-bamberg.de/rdf/',CONCAT(str(data:),'bamberg/'))) AS ?pcp_period). \n",
    "      BIND (IRI(REPLACE(str(?period_type),str(cpm:),str(pcp:))) AS ?pcp_period_type).\n",
    "\n",
    "\n",
    "      #retreive basic properties from period of Life\n",
    "      \n",
    "      OPTIONAL {?period cpm:date ?date.}\n",
    "      OPTIONAL {?period cpm:from ?from.}\n",
    "      OPTIONAL {?period cpm:to ?to.}\n",
    "      OPTIONAL {?period cpm:note ?note.}\n",
    "      \n",
    "    BIND( IF (contains(str(?period_type),'Birth'), CONCAT(\"geboren am \",str(?date)), CONCAT(\"gestorben am \",str(?date))) AS ?period_label)\n",
    "      \n",
    "      \n",
    "      OPTIONAL {?period cpm:periodPlace ?place.\n",
    "        ?place <http://schema.org/label> ?place_label.\n",
    "        BIND (IRI(REPLACE(REPLACE(str(?place),'#','_'),'http://professorenkatalog.uni-bamberg.de/rdf/',CONCAT(str(data:),'place/'))) AS ?pcp_place). \n",
    "      }\n",
    "\n",
    "    }\n",
    "  \n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "33a0e290",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Stage of Life: Ämter inkl. akademische Ämter und deren Orte\n",
      "#-----\n",
      "39889-42722\n",
      "--- 1.4452893733978271 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Stage of Life: Ämter inkl. akademische Ämter und deren Orte\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX bamberg: <http://professorenkatalog.uni-bamberg.de/>\n",
    "\n",
    "\n",
    "CONSTRUCT   {\n",
    "\n",
    "?pcp_period rdf:type ?pcp_period_type.\n",
    "?pcp_period pcp:derivedFrom ?period.\n",
    "?lecturer pcp:hasStageOfLife ?pcp_period.\n",
    "\n",
    "?pcp_period pcp:date ?date.\n",
    "?pcp_period pcp:from ?from.\n",
    "?pcp_period pcp:to ?to.\n",
    "?pcp_period rdfs:label ?period_label.\n",
    "\n",
    "\n",
    "}\n",
    "WHERE {\n",
    "\n",
    "  GRAPH data: {  \n",
    "    ?lecturer rdf:type pcp:Lecturer.\n",
    "    FILTER contains(str(?lecturer),\"/bamberg/\")\n",
    "    ?lecturer pcp:derivedFrom ?professor.\n",
    "  }\n",
    "\n",
    "  GRAPH bamberg: {  \n",
    "  \n",
    "      # Import all Professors relevant for Early Modern History\n",
    "      ?professor cpm:hasPeriod ?period.\n",
    "      ?period rdf:type cpm:PeriodOfLife.\n",
    "\n",
    "      BIND (IRI(REPLACE(REPLACE(str(?period),'#','_'),'http://professorenkatalog.uni-bamberg.de/rdf/',CONCAT(str(data:),'bamberg/'))) AS ?pcp_period). \n",
    "\n",
    "\n",
    "      #retreive basic properties from period of Life\n",
    "      \n",
    "    \n",
    "      OPTIONAL {?period cpm:periodNote ?period_label.\n",
    "      \n",
    "      BIND(\n",
    "            IF( contains(?period_label,\"Prof\")||\n",
    "            contains(?period_label,\"dekan\")||\n",
    "            contains(?period_label,\"Rektor\")||\n",
    "            contains(?period_label,\"Präsident\")||\n",
    "            contains(?period_label,\"rektor\")||\n",
    "            contains(?period_label,\"Institut\")||\n",
    "            contains(?period_label,\"institut\")||\n",
    "            contains(?period_label,\"Rat\")||\n",
    "            contains(?period_label,\"rat\")||\n",
    "            contains(?period_label,\"Kommission\")||\n",
    "            contains(?period_label,\"kommission\")||\n",
    "            contains(?period_label,\"Senat\")||\n",
    "            contains(?period_label,\"senat\")||\n",
    "            contains(?period_label,\"Leiter\")||\n",
    "            contains(?period_label,\"leiter\"), pcp:AcademicOffice,\n",
    "          \n",
    "            IF( contains(?period_label,\"Professor\")||contains(?period_label,\"Lehrer\"), pcp:OfficeLecturer, pcp:Office))\n",
    "          \n",
    "\t        AS ?pcp_period_type).  \n",
    "        \n",
    "      }\n",
    "        \n",
    "      OPTIONAL {?period cpm:date ?date.}\n",
    "      OPTIONAL {?period cpm:from ?from.}\n",
    "      OPTIONAL {?period cpm:to ?to.}\n",
    "\n",
    "\n",
    "    }\n",
    "}\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "ea569168",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Stage of Life: Karriereschritte inkl. Lehrstühle und deren Orte\n",
      "#-----\n",
      "42722-47122\n",
      "--- 2.1289074420928955 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Stage of Life: Karriereschritte inkl. Lehrstühle und deren Orte\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX bamberg: <http://professorenkatalog.uni-bamberg.de/>\n",
    "\n",
    "\n",
    "CONSTRUCT   {\n",
    "\n",
    "# Lecturer\n",
    "?pcp_period rdf:type ?pcp_period_type.\n",
    "?pcp_period pcp:derivedFrom ?period.\n",
    "?lecturer pcp:hasStageOfLife ?pcp_period.\n",
    "\n",
    "# Stage of Life dates\n",
    "?pcp_period pcp:date ?date.\n",
    "?pcp_period pcp:from ?from.\n",
    "?pcp_period pcp:to ?to.\n",
    "?pcp_period rdfs:label ?period_label.\n",
    "\n",
    "\n",
    "}\n",
    "WHERE {\n",
    "\n",
    "  GRAPH data: {  \n",
    "    ?lecturer rdf:type pcp:Lecturer.\n",
    "    FILTER contains(str(?lecturer),\"/bamberg/\")\n",
    "    ?lecturer pcp:derivedFrom ?professor.\n",
    "  }\n",
    "\n",
    "  \n",
    "  GRAPH bamberg: {  \n",
    "  \n",
    "\n",
    "    ?professor cpm:hasPeriod ?period.\n",
    "    ?period rdf:type cpm:Career.\n",
    "\n",
    "    BIND (IRI(REPLACE(REPLACE(str(?period),'#','_'),'http://professorenkatalog.uni-bamberg.de/rdf/',CONCAT(str(data:),'bamberg/'))) AS ?pcp_period). \n",
    "\n",
    "    OPTIONAL {\n",
    "      ?period cpm:periodNote ?period_label.\n",
    "      BIND( IF(contains(?period_label,\"Prof\"), pcp:ChairProfessorship, pcp:OfficeLecturer) AS ?pcp_period_type).  \n",
    "    }\n",
    "        \n",
    "    OPTIONAL {?period cpm:date ?date.}\n",
    "    OPTIONAL {?period cpm:from ?from.}\n",
    "    OPTIONAL {?period cpm:to ?to.}\n",
    "\n",
    "\n",
    "  }\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "7d4b83f9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Vervollständigen der Körperschaften zu Periods of Life\n",
      "#-----\n",
      "47122-47988\n",
      "--- 1.10023832321167 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Vervollständigen der Körperschaften zu Periods of Life\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX bamberg: <http://professorenkatalog.uni-bamberg.de/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "\n",
    "\n",
    "CONSTRUCT   {\n",
    "\n",
    "# Beziehung zu Stage of Life\n",
    "\n",
    "?pcp_stage ?pcp_bodyprop ?pcp_body.\n",
    "\n",
    "# Körperschaft: Fakultät oder Hochschule\n",
    "?pcp_body rdfs:label ?body_label.\n",
    "?pcp_body owl:sameAs ?body_sameas.\n",
    "?pcp_body rdfs:seeAlso ?body_link.\n",
    "?pcp_body rdfs:seeAlso ?body_homepage.\n",
    "?pcp_body rdf:type ?pcp_bodytype.\n",
    "\n",
    "\n",
    "# Location\n",
    "?pcp_body pcp:locationCorporation ?pcp_place.\n",
    "?pcp_place rdf:type pcp:Location.\n",
    "?pcp_place rdfs:label ?place_label.\n",
    "\n",
    "\n",
    "}\n",
    "WHERE {\n",
    "  GRAPH data: {\n",
    "    ?person pcp:hasStageOfLife ?pcp_stage.\n",
    "    FILTER contains(str(?pcp_stage),'/bamberg/')\n",
    "    ?pcp_stage pcp:derivedFrom ?period .\n",
    "    GRAPH bamberg: {  \n",
    "    \n",
    "        ?period cpm:periodBody ?body.\n",
    "        ?body cpm:typeOfBody ?body_type.\n",
    "        FILTER ((contains(?body_type,\"Fakultät\")) || (contains(?body_type,\"Hochschule\")))\n",
    "        BIND ( IF( contains(?body_type,\"Fakultät\"), pcp:Faculty, pcp:University) AS ?pcp_bodytype )\n",
    "        BIND ( IF( contains(?body_type,\"Fakultät\"), pcp:hasFaculty, pcp:hasUniversity) AS ?pcp_bodyprop )\n",
    "        BIND (IRI(REPLACE(REPLACE(str(?body),'#','_'),'http://professorenkatalog.uni-bamberg.de/rdf/',CONCAT(str(data:),'bamberg/'))) AS ?pcp_body). \n",
    "        \n",
    "        OPTIONAL { ?body <http://schema.org/label> ?body_label. }\n",
    "        OPTIONAL { ?body foaf:homepage ?body_homepage.}        \n",
    "        OPTIONAL { ?body owl:sameAs ?body_sameas.}\n",
    "        OPTIONAL { ?body cpm:weblink ?body_link.}\n",
    "\n",
    "\n",
    "        OPTIONAL {\n",
    "            ?body cpm:bodyPlace ?place.\n",
    "            ?place <http://schema.org/label> ?place_label.\n",
    "            BIND (IRI(REPLACE(REPLACE(str(?place),'#','_'),'http://professorenkatalog.uni-bamberg.de/rdf/',CONCAT(str(data:),'bamberg/'))) AS ?pcp_place). \n",
    "        }\n",
    "    }\n",
    "  }\n",
    "}\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "6576e0df",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Vervollständigung Körperschaften\n",
      "#-----\n",
      "47988-47988\n",
      "--- 0.3029043674468994 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Vervollständigung Körperschaften\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX bamberg: <http://professorenkatalog.uni-bamberg.de/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "\n",
    "CONSTRUCT   {\n",
    "\n",
    "# Fakultät\n",
    "?pcp_faculty rdfs:label ?faculty_label.\n",
    "?pcp_faculty owl:sameAs ?faculty_sameas.\n",
    "?pcp_faculty rdfs:seeAlso ?faculty_link.\n",
    "\n",
    "}\n",
    "WHERE {\n",
    "  GRAPH data: {\n",
    "    ?pcp_faculty rdf:type pcp:Faculty.\n",
    "    FILTER contains(str(?pcp_faculty),'/bamberg/')\n",
    "    ?pcp_faculty pcp:derivedFrom ?body\n",
    "    GRAPH bamberg: {  \n",
    "        OPTIONAL {?body <http://schema.org/label> ?faculty_label.}\n",
    "        OPTIONAL {?body owl:sameAs ?faculty_sameas.}\n",
    "        OPTIONAL {?body cpm:weblink ?faculty_link.}\n",
    "    }\n",
    "  }\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))\n",
    "\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "bff71298",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Korrekturen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a6e55b1f",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
