{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "353f1ac7",
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, RDFXML, JSON\n",
    "import requests\n",
    "import time\n",
    "\n",
    "# Basic configuration\n",
    "endpoint = \"https://wb.pcp-on-web.de/store-oker/research/\"\n",
    "#query_path = \"https://raw.githubusercontent.com/pcp-on-web/data-import/main/Import-Catalogus-Professorum-Lipsiensium/\"\n",
    "\n",
    "\n",
    "# This function counts the genrated tripples of the research ontolgy (data:)\n",
    "def count_triples(endpoint,graph) :\n",
    "    #count number of exiting triples\n",
    "    sparql = SPARQLWrapper(endpoint+'sparql')\n",
    "    sparql.setQuery('SELECT (COUNT(*) as ?Triples) FROM '+graph+' WHERE { ?s ?p ?o}')\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    json_results = sparql.query().convert()\n",
    "    return json_results['results']['bindings'][0]['Triples']['value']\n",
    "    \n",
    "\n",
    "# This function executes a sparql construct query and imports the data to the research ontolgy (data:)\n",
    "def query_sparql(query, endpoint) :\n",
    "    start_time = time.time()\n",
    "    \n",
    "    #perform construct Query\n",
    "    sparql = SPARQLWrapper(endpoint+'sparql')\n",
    "  \n",
    "    #query += \" LIMIT 10\"\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(RDFXML)\n",
    "    sparql.setOnlyConneg(True)\n",
    "    resultsets = sparql.query().convert()\n",
    "    result = resultsets.serialize(format='ttl')\n",
    "    \n",
    "    # Add PREFIXs to data to insert\n",
    "    data=\"\"\n",
    "    data_graph=\"leer\"\n",
    "    text_lines = query.split(\"\\n\")\n",
    "    info = text_lines[1]+\"\\n\"+text_lines[2]\n",
    "    for line in text_lines:\n",
    "        if line.find(\"PREFIX \")==0:\n",
    "           data += line + \"\\n\"\n",
    "           p = 0\n",
    "           p = line.find(\"PREFIX data:\") \n",
    "           if p == 0 :\n",
    "                data_graph = line[line.find(\"<\"):]\n",
    "            \n",
    "    # Add SPARQL INSERT to data to insert\n",
    "    data += \"INSERT DATA {\\nGRAPH data:\\n{\\n\"\n",
    "    text_lines = result.split(\"\\n\")\n",
    "    for line in text_lines:\n",
    "        if line.find(\"@prefix \")==-1:\n",
    "           data += line + \"\\n\"\n",
    "    # Close\n",
    "    data += \"}}\"\n",
    "   \n",
    "    start_count = count_triples(endpoint,data_graph)\n",
    "    \n",
    "    sparql = SPARQLWrapper(endpoint)\n",
    "    sparql.setQuery(data)\n",
    "    sparql.method = 'POST'\n",
    "    sparql.query()\n",
    "\n",
    "    end_count = count_triples(endpoint,data_graph)\n",
    "\n",
    "    output =  \"\\n\"+info+\"\\n\"+start_count + \"-\" + end_count + \"\\n--- \" + str(time.time() - start_time) + \" seconds ---\"\n",
    "    return output\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "dce03656",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Basic Import of Lecturers including relevant attributes and pictures\n",
      "#-----\n",
      "0-3986\n",
      "--- 2.9427943229675293 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Basic Import of Lecturers including relevant attributes and pictures\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX cpl: <http://catalogus-professorum.org/lipsiensium/>\n",
    "\n",
    "\n",
    "\n",
    "CONSTRUCT   {\n",
    "\n",
    "?lecturer rdf:type pcp:Lecturer.\n",
    "?lecturer pcp:derivedFrom ?professor.\n",
    "\n",
    "?lecturer pcp:gnd ?gnd.\n",
    "?lecturer rdfs:label ?label .\n",
    "?lecturer pcp:note ?note .\n",
    "?lecturer pcp:furtherInformation ?furtherInformation .\n",
    "?lecturer pcp:additionToSurname ?additionToSurname .\n",
    "?lecturer pcp:alternativeWritingOfSurname ?alternativeWritingOfSurname .\n",
    "?lecturer pcp:forename ?forename .\n",
    "?lecturer pcp:surname ?surname .\n",
    "?lecturer rdfs:seeAlso ?webLink .\n",
    "?lecturer rdfs:seeAlso ?seeAlso .\n",
    "?lecturer rdfs:seeAlso ?lectureLink .\n",
    "\n",
    "#  ?lecturer pcp:idPerson ?idPerson .\n",
    "#  ?lecturer pcp:birthname ?birthname .\n",
    "#  ?lecturer pcp:corresponds ?corresponds .\n",
    "#  ?lecturer pcp:hasEnrollment ?hasEnrollment .\n",
    "#  ?lecturer pcp:hasOrigin ?hasOrigin .\n",
    "#  ?lecturer pcp:isAttributedTo ?isAttributedTo .\n",
    "#  ?lecturer pcp:latinForename ?latinForename .\n",
    "#  ?lecturer pcp:latinSurname ?latinSurname .\n",
    "\n",
    "\n",
    "?pcp_uri_picture pcp:derivedFrom ?picture .\n",
    "?pcp_uri_picture rdf:type pcp:Picture.\n",
    "?lecturer pcp:relatedDocument ?uri_pcp_picture.\n",
    "?uri_pcp_picture pcp:pictureURL ?picture_url.\n",
    "?uri_pcp_picture pcp:pictureArchive ?picture_archive.\n",
    "?uri_pcp_picture pcp:pictureKey ?picture_key.\n",
    "\n",
    "\n",
    "}\n",
    "WHERE {\n",
    "  \n",
    "  GRAPH cpl: {  \n",
    "\n",
    "      # Import all Professors relevant for Early Modern History\n",
    "      ?professor a cpm:Professor.\n",
    "      ?professor cpm:hasPeriod ?prof_birth.\n",
    "      ?prof_birth rdf:type cpm:Birth.\n",
    "      ?prof_birth cpm:date ?prof_birth_date .\n",
    "      BIND (xsd:integer(substr(str(?prof_birth_date), 1, 4)) as ?prof_birth_year)       \n",
    "      FILTER (!BOUND(?prof_birth_year) || ((?prof_birth_year>1450) && (?prof_birth_year<1800)))\n",
    "      BIND (IRI(REPLACE(str(?professor),'http://catalogus-professorum.org/',str(data:))) AS ?lecturer). \n",
    "\n",
    "      #retreive basic properties from professor\n",
    "      \n",
    "      OPTIONAL {\n",
    "        ?professor rdfs:label ?label_lang.\n",
    "        BIND(str(?label_lang) as ?label) # Remove language tags from label\n",
    "      }\n",
    "      OPTIONAL {?professor cpm:note ?note.}\n",
    "      OPTIONAL {?professor cpm:furtherInformation ?furtherInformation.}\n",
    "      OPTIONAL {?professor cpm:webLink ?webLink.}\n",
    "      OPTIONAL {?professor rdfs:seeAlso ?seeAlso.}\n",
    "      OPTIONAL {?professor cpm:forename ?forename.}\n",
    "      OPTIONAL {?professor cpm:surname ?surname.}\n",
    "      OPTIONAL {?professor cpm:references ?references.}\n",
    "      OPTIONAL {?professor cpm:literature ?literature.}\n",
    "      OPTIONAL {?professor cpm:alternativeWritingOfSurname ?alternativeWritingOfSurname.}\n",
    "\n",
    "      #Link to lecture repository / Vorlesungsverzeichnis\n",
    "      OPTIONAL {?professor cpm:lectureLink ?lectureLink.}\n",
    "\n",
    "      #Not used basic properties\n",
    "      #OPTIONAL {?professor cpm:denomination ?denomination.}\n",
    "      #OPTIONAL {?professor cpm:fullAcademicalTitle ?fullAcademicalTitle.}\n",
    "      #OPTIONAL {?professor cpm:firstName ?firstName.}\n",
    "      #OPTIONAL {?professor cpm:additionToSurname ?additionToSurname.}\n",
    "      #OPTIONAL {?professor cpm:isTutor ?isTutor.}\n",
    "      #OPTIONAL {?professor cpm:profession ?profession.}\n",
    "      #OPTIONAL {?professor cpm:published ?published.}\n",
    "\n",
    "      #retrieve gnd and convert to IRI\n",
    "      OPTIONAL {\n",
    "        ?professor cpm:gnd ?gnd_source.\n",
    "        BIND(\n",
    "          IF ( \n",
    "              #1\n",
    "              contains(?gnd_source,\"http\"),\n",
    "              #2\n",
    "              IRI(REPLACE(str(?gnd_source),'http://','https://')),\n",
    "              #3\n",
    "                #3.1\n",
    "                IF ( contains(?gnd_source,\" \"),\n",
    "                #3.2\n",
    "                \n",
    "                    #3.2.1\n",
    "                    IF (contains(?gnd_source,\"(DNB)\"),\n",
    "                    #3.2.2\n",
    "                    IRI(CONCAT(\"https://d-nb.info/gnd/\",REPLACE(?gnd_source,\" \\\\\\\\(DNB\\\\\\\\)\",\"\"))),\n",
    "                    #3.2.3\n",
    "                    \"\"),\n",
    "                #3.3\n",
    "                IRI(CONCAT(\"https://d-nb.info/gnd/\",?gnd_source)))\n",
    "            ) as ?gnd ).\n",
    "        FILTER isIRI(?gnd).\n",
    "        }\n",
    "\n",
    "    OPTIONAL {?professor cpm:hasPicture ?picture.\n",
    "        BIND (IRI(REPLACE(str(?picture),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_uri_picture). \n",
    "\n",
    "        OPTIONAL {?picture cpm:picture ?picture_url . }\n",
    "        OPTIONAL {?picture cpm:pictureArchive ?picture_archive . }\n",
    "        OPTIONAL {?picture cpm:pictureKey ?picture_key .}\n",
    "    }\n",
    "  }\n",
    "}\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "71761181",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Stage of Life: Birth and Death of Lecturers\n",
      "#-----\n",
      "3986-7001\n",
      "--- 1.3264555931091309 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Stage of Life: Birth and Death of Lecturers\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX cpl: <http://catalogus-professorum.org/lipsiensium/>\n",
    "\n",
    "CONSTRUCT   {\n",
    "\n",
    "?pcp_period rdf:type ?pcp_period_type.\n",
    "?pcp_period pcp:derivedFrom ?period.\n",
    "?lecturer pcp:hasStageOfLife ?pcp_period.\n",
    "\n",
    "?pcp_period pcp:date ?date.\n",
    "?pcp_period rdfs:label ?period_label.\n",
    "?pcp_period pcp:stageOfLifeLocation ?pcp_place.\n",
    "?pcp_place rdf:type pcp:Location.\n",
    "?pcp_place rdfs:label ?place_label.\n",
    "?pcp_place pcp:derivedFrom ?place.\n",
    "\n",
    "\n",
    "}\n",
    "WHERE {\n",
    "  \n",
    "  GRAPH cpl: {  \n",
    "\n",
    "      # Import all Professors relevant for Early Modern History\n",
    "      ?professor a cpm:Professor.\n",
    "      ?professor cpm:hasPeriod ?prof_birth.\n",
    "      ?prof_birth rdf:type cpm:Birth.\n",
    "      ?prof_birth cpm:date ?prof_birth_date .\n",
    "      BIND (xsd:integer(substr(str(?prof_birth_date), 1, 4)) as ?prof_birth_year)       \n",
    "      FILTER (!BOUND(?prof_birth_year) || ((?prof_birth_year>1450) && (?prof_birth_year<1800)))\n",
    "      BIND (IRI(REPLACE(str(?professor),'http://catalogus-professorum.org/',str(data:))) AS ?lecturer). \n",
    "    \n",
    "    \n",
    "    \n",
    "    ?professor cpm:hasPeriod ?period.\n",
    "    ?period rdf:type ?period_type.\n",
    "    FILTER(contains(str(?period_type),\"Birth\")||contains(str(?period_type),\"Death\"))\n",
    "    BIND (IRI(REPLACE(str(?period),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_period).\n",
    "    BIND (IRI(REPLACE(str(?period_type),str(cpm:),str(pcp:))) AS ?pcp_period_type).\n",
    "    \n",
    "    OPTIONAL {?period rdfs:label ?period_label.}\n",
    "    OPTIONAL {?period cpm:date ?date.}\n",
    "    OPTIONAL {?period cpm:periodPlace ?place.\n",
    "        ?place rdfs:label ?place_label.\n",
    "        BIND (IRI(REPLACE(str(?place),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_place). \n",
    "        }\n",
    "\n",
    "    }\n",
    "}\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "0afdff09",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Stage of Life: Ämter inkl. akademische Ämter und deren Orte\n",
      "#-----\n",
      "7001-13383\n",
      "--- 3.5033512115478516 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Stage of Life: Ämter inkl. akademische Ämter und deren Orte\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX cpl: <http://catalogus-professorum.org/lipsiensium/>\n",
    "\n",
    "CONSTRUCT   {\n",
    "\n",
    "# Lecturer\n",
    "\n",
    "?pcp_period rdf:type ?pcp_period_type.\n",
    "?pcp_period pcp:derivedFrom ?period.\n",
    "?lecturer pcp:hasStageOfLife ?pcp_period.\n",
    "\n",
    "# Stage of Life dates\n",
    "?pcp_period pcp:date ?date.\n",
    "?pcp_period pcp:from ?from.\n",
    "?pcp_period pcp:to ?to.\n",
    "?pcp_period rdfs:label ?period_label.\n",
    "\n",
    "# Stage of Life location\n",
    "?pcp_period pcp:stageOfLifeLocation ?pcp_place.\n",
    "?pcp_place rdf:type pcp:Location.\n",
    "?pcp_place rdfs:label ?place_label.\n",
    "?pcp_place pcp:derivedFrom ?place.\n",
    "\n",
    "# Stage of Life Body\n",
    "?pcp_period ?pcp_hasBody ?pcp_body.\n",
    "?pcp_body rdf:type ?pcp_isBody.\n",
    "?pcp_body pcp:derivedFrom ?body.\n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "WHERE {\n",
    "  \n",
    "  GRAPH cpl: {  \n",
    "\n",
    "\n",
    "      # Professors relevant for Early Modern History\n",
    "      \n",
    "      ?professor a cpm:Professor.\n",
    "      ?professor cpm:hasPeriod ?prof_birth.\n",
    "      ?prof_birth rdf:type cpm:Birth.\n",
    "      ?prof_birth cpm:date ?prof_birth_date .\n",
    "      BIND (xsd:integer(substr(str(?prof_birth_date), 1, 4)) as ?prof_birth_year)       \n",
    "      FILTER (!BOUND(?prof_birth_year) || ((?prof_birth_year>1450) && (?prof_birth_year<1800)))\n",
    "      BIND (IRI(REPLACE(str(?professor),'http://catalogus-professorum.org/',str(data:))) AS ?lecturer). \n",
    "    \n",
    "\n",
    "      # Karriereschritte Ämter\n",
    "\n",
    "      ?professor cpm:hasPeriod ?period.\n",
    "      ?period rdf:type cpm:Office.\n",
    "      BIND (IRI(REPLACE(str(?period),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_period).\n",
    "    \n",
    "      OPTIONAL {\n",
    "        ?period rdfs:label ?period_label.\n",
    "        BIND(\n",
    "            IF( contains(?period_label,\"Dekan\")||\n",
    "                contains(?period_label,\"dekan\")||\n",
    "            contains(?period_label,\"Rektor\")||\n",
    "            contains(?period_label,\"rektor\")||\n",
    "            contains(?period_label,\"Institut\")||\n",
    "            contains(?period_label,\"institut\")||\n",
    "            contains(?period_label,\"Rat\")||\n",
    "            contains(?period_label,\"rat\")||\n",
    "            contains(?period_label,\"Kommission\")||\n",
    "            contains(?period_label,\"kommission\")||\n",
    "            contains(?period_label,\"Senat\")||\n",
    "            contains(?period_label,\"senat\")||\n",
    "            contains(?period_label,\"Leiter\")||\n",
    "            contains(?period_label,\"leiter\"), pcp:AcademicOffice, pcp:Office)\n",
    "            AS ?pcp_period_type).  \n",
    "        \n",
    "      }\n",
    "        \n",
    "      OPTIONAL {?period cpm:date ?date.}\n",
    "      OPTIONAL {?period cpm:from ?from.}\n",
    "      OPTIONAL {?period cpm:to ?to.}\n",
    "\n",
    "      OPTIONAL {\n",
    "      \n",
    "        # Körperschaft eines Karriereschritts i.d.R. Fakultät\n",
    "        \n",
    "        ?period cpm:periodBody ?body.\n",
    "        ?body rdf:type cpm:Faculty .\n",
    "        BIND (pcp:Faculty AS ?pcp_isBody). \n",
    "        BIND (pcp:hasFaculty AS ?pcp_hasBody). \n",
    "        \n",
    "        \n",
    "         BIND (IRI(REPLACE(str(?body),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_body). \n",
    "        \n",
    "        # Ort, wenn dieser existiert\n",
    "        \n",
    "        OPTIONAL {\n",
    "            ?body cpm:bodyPlace ?place.\n",
    "            ?place rdfs:label ?place_label.\n",
    "            BIND (IRI(REPLACE(str(?place),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_place). \n",
    "        }\n",
    "\n",
    "        # Ort, wenn dieser Karriereschritt an eine ander Körperschaft gebunden ist i.d.R. Universität\n",
    "\n",
    "        OPTIONAL {\n",
    "            ?body cpm:isPartOf ?university.\n",
    "            ?university rdf:type cpm:Academy .\n",
    "            ?university cpm:bodyPlace ?place.\n",
    "            ?place rdfs:label ?place_label.\n",
    "            BIND (IRI(REPLACE(str(?place),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_place). \n",
    "        }\n",
    "\n",
    "      }\n",
    "\n",
    "      OPTIONAL {\n",
    "      \n",
    "        # Körperschaft eines Karriereschritts i.d.R. Fakultät\n",
    "        \n",
    "        ?period cpm:periodBody ?body.\n",
    "        ?body rdf:type cpm:Academy .\n",
    "        BIND (pcp:University AS ?pcp_isBody). \n",
    "        BIND (pcp:hasUniversity AS ?pcp_hasBody). \n",
    "        \n",
    "        \n",
    "         BIND (IRI(REPLACE(str(?body),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_body). \n",
    "        \n",
    "        # Ort, wenn dieser existiert\n",
    "        \n",
    "        OPTIONAL {\n",
    "            ?body cpm:bodyPlace ?place.\n",
    "            ?place rdfs:label ?place_label.\n",
    "            BIND (IRI(REPLACE(str(?place),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_place). \n",
    "        }\n",
    "\n",
    "\n",
    "      }\n",
    "\n",
    "\n",
    "\n",
    "    }\n",
    "}\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "d9950d1b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Stage of Life: Karriereschritte inkl. Lehrstühle und deren Orte\n",
      "#-----\n",
      "13383-19186\n",
      "--- 3.0589981079101562 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Stage of Life: Karriereschritte inkl. Lehrstühle und deren Orte\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX cpl: <http://catalogus-professorum.org/lipsiensium/>\n",
    "\n",
    "CONSTRUCT   {\n",
    "\n",
    "# Lecturer\n",
    "?pcp_period rdf:type ?pcp_period_type.\n",
    "?pcp_period pcp:derivedFrom ?period.\n",
    "?lecturer pcp:hasStageOfLife ?pcp_period.\n",
    "\n",
    "# Stage of Life dates\n",
    "?pcp_period pcp:date ?date.\n",
    "?pcp_period pcp:from ?from.\n",
    "?pcp_period pcp:to ?to.\n",
    "?pcp_period rdfs:label ?period_label.\n",
    "\n",
    "# Stage of Life location\n",
    "?pcp_period pcp:stageOfLifeLocation ?pcp_place.\n",
    "?pcp_place rdf:type pcp:Location.\n",
    "?pcp_place rdfs:label ?place_label.\n",
    "?pcp_place pcp:derivedFrom ?place.\n",
    "\n",
    "# Stage of Life Body\n",
    "?pcp_period ?pcp_hasBody ?pcp_body.\n",
    "?pcp_body rdf:type ?pcp_isBody.\n",
    "?pcp_body pcp:derivedFrom ?body.\n",
    "\n",
    "}\n",
    "WHERE {\n",
    "  \n",
    "  GRAPH cpl: {  \n",
    "  \n",
    "      # Relevante Professoren für die Frühe Neuzeit \n",
    "      \n",
    "      ?professor a cpm:Professor.\n",
    "      ?professor cpm:hasPeriod ?prof_birth.\n",
    "      ?prof_birth rdf:type cpm:Birth.\n",
    "      ?prof_birth cpm:date ?prof_birth_date .\n",
    "      BIND (xsd:integer(substr(str(?prof_birth_date), 1, 4)) as ?prof_birth_year)       \n",
    "      FILTER (!BOUND(?prof_birth_year) || ((?prof_birth_year>1450) && (?prof_birth_year<1800)))\n",
    "      BIND (IRI(REPLACE(str(?professor),'http://catalogus-professorum.org/',str(data:))) AS ?lecturer). \n",
    "    \n",
    "\n",
    "      # Karriereschritte \n",
    "\n",
    "      ?professor cpm:hasPeriod ?period.\n",
    "      ?period rdf:type cpm:Career.\n",
    "      BIND (IRI(REPLACE(str(?period),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_period).\n",
    "      OPTIONAL {?period rdfs:label ?period_label.\n",
    "        BIND(\n",
    "              IF( contains(?period_label,\" oProf\")||\n",
    "                  contains(?period_label,\"Professor mit Lehrstuhl\") ||\n",
    "                  contains(?period_label,\" oHonProf\") ||\n",
    "                  contains(?period_label,\" plaoProf\") ||\n",
    "                  contains(?period_label,\" o. Prof\") ||\n",
    "                  contains(?period_label,\" ordentliche Professorin\") ||\n",
    "                  contains(?period_label,\" ordentlicher Professor\"), pcp:ChairProfessorship,\n",
    "              IF( contains(?period_label,\" aoProf\") ||\n",
    "                  contains(?period_label,\" außerordentliche\") ||\n",
    "                  contains(?period_label,\"Vertretungsprof\") ||\n",
    "                  contains(?period_label,\"Gastprof\") ||\n",
    "                  contains(?period_label,\"Gast-Prof\") ||\n",
    "                  contains(?period_label,\"visting professor\") ||\n",
    "                  contains(?period_label,\"HonProf\") ||\n",
    "                  contains(?period_label,\"Honorar\") ||\n",
    "                  contains(?period_label,\" apl. Prof\") ||\n",
    "                  contains(?period_label,\" aplProf\") ||\n",
    "                  contains(?period_label,\" nplao Prof\") || \n",
    "                  contains(?period_label,\" nplaoProf\") || \n",
    "                  contains(?period_label,\"Professor mit vollem Lehrauftrag\") ||\n",
    "                  contains(?period_label,\" ao. Prof\") , pcp:AssociateProfessor,\n",
    "              IF( contains(?period_label,\"PD\") ||\n",
    "                  contains(?period_label,\"Privat\") ||\n",
    "                  contains(?period_label,\"privat\") , pcp:PrivateLecturer,\n",
    "              IF( contains(?period_label,\"Lecturer\") ||\n",
    "                  contains(?period_label,\"Lehrbeauftragt\") ||\n",
    "                  contains(?period_label,\"dozent\") ||\n",
    "                  contains(?period_label,\"Lehrauftrag\") ||\n",
    "                  contains(?period_label,\"Dozent\") , pcp:OfficeLecturer,\n",
    "              IF( contains(?period_label,\"Prof\"), pcp:ChairProfessorship,\n",
    "                      pcp:AcademicOffice)))))  AS ?pcp_period_type).  \n",
    "\n",
    "      }\n",
    "\n",
    "      OPTIONAL {?period cpm:date ?date.}\n",
    "      OPTIONAL {?period cpm:from ?from.}\n",
    "      OPTIONAL {?period cpm:to ?to.}\n",
    "\n",
    "      OPTIONAL {\n",
    "      \n",
    "        # Körperschaft eines Karriereschritts hier Fakultät\n",
    "        \n",
    "        ?period cpm:periodBody ?body.\n",
    "        ?body rdf:type cpm:Faculty .\n",
    "        BIND (pcp:Faculty AS ?pcp_isBody). \n",
    "        BIND (pcp:hasFaculty AS ?pcp_hasBody). \n",
    "\n",
    "        \n",
    "         BIND (IRI(REPLACE(str(?body),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_body). \n",
    "        \n",
    "        # Ort, wenn dieser existiert\n",
    "        \n",
    "        OPTIONAL {\n",
    "            ?body cpm:bodyPlace ?place.\n",
    "            ?place rdfs:label ?place_label.\n",
    "            BIND (IRI(REPLACE(str(?place),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_place). \n",
    "        }\n",
    "\n",
    "        # Ort, wenn dieser Karriereschritt an eine ander Körperschaft gebunden ist i.d.R. Universität\n",
    "\n",
    "        OPTIONAL {\n",
    "            ?body cpm:isPartOf ?university.\n",
    "            ?university rdf:type cpm:Academy .\n",
    "            ?university cpm:bodyPlace ?place.\n",
    "            ?place rdfs:label ?place_label.\n",
    "            BIND (IRI(REPLACE(str(?place),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_place). \n",
    "        }\n",
    "\n",
    "      }\n",
    "\n",
    "\n",
    "      OPTIONAL {\n",
    "      \n",
    "        # Körperschaft eines Karriereschritts i.d.R. Fakultät\n",
    "        \n",
    "        ?period cpm:periodBody ?body.\n",
    "        ?body rdf:type cpm:Academy .\n",
    "        BIND (pcp:University AS ?pcp_isBody). \n",
    "        BIND (pcp:hasUniversity AS ?pcp_hasBody). \n",
    "        \n",
    "        \n",
    "         BIND (IRI(REPLACE(str(?body),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_body). \n",
    "        \n",
    "        # Ort, wenn dieser existiert\n",
    "        \n",
    "        OPTIONAL {\n",
    "            ?body cpm:bodyPlace ?place.\n",
    "            ?place rdfs:label ?place_label.\n",
    "            BIND (IRI(REPLACE(str(?place),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_place). \n",
    "        }\n",
    "\n",
    "      }\n",
    "\n",
    "\n",
    "\n",
    "    }\n",
    "}\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "2ad509f8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Vervollständigung Stage of Life\n",
      "#-----\n",
      "19186-19186\n",
      "--- 2.6677091121673584 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Vervollständigung Stage of Life (ist ggf. doppelt zum vorherigen Import)\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX cpl: <http://catalogus-professorum.org/lipsiensium/>\n",
    "\n",
    "CONSTRUCT   {\n",
    "\n",
    "# Stage of Life dates\n",
    "?pcp_period pcp:date ?date.\n",
    "?pcp_period pcp:from ?from.\n",
    "?pcp_period pcp:to ?to.\n",
    "?pcp_period rdfs:label ?period_label.\n",
    "\n",
    "}\n",
    "WHERE {\n",
    "\n",
    "  GRAPH data: {\n",
    "    ?pcp_period rdf:type ?stage_type.\n",
    "    FILTER contains(str(?pcp_period),'lipsiensium')\n",
    "    FILTER ( ?stage_type=pcp:Office ||\n",
    "        ?stage_type=pcp:AcademicOffice  ||\n",
    "        ?stage_type=pcp:ChairProfessorship  ||\n",
    "        ?stage_type=pcp:AssociateProfessor  ||\n",
    "        ?stage_type=pcp:OfficeLecturer  ||\n",
    "        ?stage_type=pcp:PrivateLecturer  \n",
    "    )\n",
    "    ?pcp_period pcp:derivedFrom ?period.\n",
    "\n",
    "    GRAPH cpl: {  \n",
    "        OPTIONAL {?period rdfs:label ?period_label.}\n",
    "        OPTIONAL {?period cpm:date ?date.}\n",
    "        OPTIONAL {?period cpm:from ?from.}\n",
    "        OPTIONAL {?period cpm:to ?to.}\n",
    "    }\n",
    "  }\n",
    "}\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "7e4016f7",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Vervollständigung Fakultäten\n",
      "#-----\n",
      "19186-19198\n",
      "--- 0.72648024559021 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Vervollständigung Fakultäten\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX cpl: <http://catalogus-professorum.org/lipsiensium/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "\n",
    "CONSTRUCT   {\n",
    "\n",
    "# Fakultät\n",
    "?pcp_faculty rdfs:label ?faculty_label.\n",
    "?pcp_faculty owl:sameAs ?faculty_sameas.\n",
    "?pcp_faculty rdfs:seeAlso ?faculty_link.\n",
    "?pcp_faculty pcp:isPartOfUniversity ?pcp_university.\n",
    "\n",
    "\n",
    "}\n",
    "WHERE {\n",
    "  GRAPH data: {\n",
    "    ?pcp_faculty rdf:type pcp:Faculty.\n",
    "    FILTER contains(str(?pcp_faculty),'lipsiensium')\n",
    "    ?pcp_faculty pcp:derivedFrom ?body\n",
    "    GRAPH cpl: {  \n",
    "        OPTIONAL {?body rdfs:label ?faculty_label.}\n",
    "        OPTIONAL {?body owl:sameAs ?faculty_sameas.}\n",
    "        OPTIONAL {?body cpm:weblink ?faculty_link.}\n",
    "    }\n",
    "\n",
    "\n",
    "  }\n",
    "}\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))\n",
    "\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3009fb2f",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "33c7f054",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "# Vervollständigung Universitäten\n",
      "#-----\n",
      "19198-19278\n",
      "--- 1.40877366065979 seconds ---\n"
     ]
    }
   ],
   "source": [
    "data = \"\"\"\n",
    "# Vervollständigung Universitäten\n",
    "#-----\n",
    "\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX pcp: <http://pcp-on-web.de/ontology#>\n",
    "PREFIX data: <http://data.pcp-on-web.de/v.1/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX cpm: <http://catalogus-professorum.org/cpm/2/>\n",
    "PREFIX cpl: <http://catalogus-professorum.org/lipsiensium/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "\n",
    "CONSTRUCT   {\n",
    "\n",
    "# University\n",
    "?pcp_university rdfs:label ?university_label.\n",
    "?pcp_university owl:sameAs ?university_sameas.\n",
    "?pcp_university rdfs:seeAlso ?university_link.\n",
    "\n",
    "# Universitätsort\n",
    "\n",
    "?pcp_university pcp:locationCorporation ?pcp_place.\n",
    "?pcp_place rdf:type pcp:Location.\n",
    "?pcp_place rdfs:label ?place_label.\n",
    "\n",
    "\n",
    "}\n",
    "WHERE {\n",
    "  GRAPH data: {\n",
    "    ?pcp_university rdf:type pcp:University.\n",
    "    FILTER contains(str(?pcp_university),'lipsiensium')\n",
    "    ?pcp_university pcp:derivedFrom ?body\n",
    "    GRAPH cpl: {  \n",
    "        OPTIONAL {?body rdfs:label ?university_label.}\n",
    "        OPTIONAL {?body owl:sameAs ?university_sameas.}\n",
    "        OPTIONAL {?body cpm:weblink ?university_link.}\n",
    "        OPTIONAL {\n",
    "            ?body cpm:bodyPlace ?place.\n",
    "            ?place rdfs:label ?place_label.\n",
    "            BIND (IRI(REPLACE(str(?place),'http://catalogus-professorum.org/',str(data:))) AS ?pcp_place).             \n",
    "        }\n",
    "    }\n",
    "  }\n",
    "}\n",
    "\"\"\"\n",
    "print(query_sparql(data,endpoint))\n",
    "\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "4ea07d38",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Erledigt:\n",
    "#cpm:Birth: 1849\n",
    "#cpm:Death: 1503\n",
    "#cpm:Office: 1660\n",
    "#cpm:Career: 5929\n",
    "\n",
    "#Offen:\n",
    "#cpm:Membership: 194\n",
    "#cpm:Study: 1843\n",
    "#cpm:PeriodOfLife: 27\n",
    "#cpm:Family: 2863\n",
    "#cpm:Graduation: 1365\n",
    "#cpm:SocialRole: 3602\n",
    "#cpm:Qualification: 3611"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
